# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ODConv2d, [64, 3, 2]] # 0-P1/2
  - [-1, 1, LAE, []] # 1-P2/4
  - [-1, 3, LCCS, [128, True]]
  - [-1, 1, LAE, []] # 3-P3/8
  - [-1, 6, LCCS, [256, True]]
  - [-1, 1, LAE, []] # 5-P4/16
  - [-1, 6, LCCS, [512, True]]
  - [-1, 1, LAE, []] # 7-P5/32
  - [-1, 3, LCCS, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PFE, [1024]] # 10

# YOLOv10.0n head
head:
  - [ 4, 1, ODConv2d, [256, 3, 1] ]  # 11-P3/8
  - [ 6, 1, ODConv2d, [256, 3, 1] ]  # 12-P4/16
  - [ 10, 1, ODConv2d, [256, 3, 1] ]  # 13-P5/32

  - [-1, 1, CARAFE, []] # 14 P5->P4
  - [[-1, 12], 1, Bi_FPN, []] # 15
  - [-1, 1, ECA, []]  # 16-P4/16

  - [-1, 1, CARAFE, []] # 17 P4->P3
  - [[-1, 11], 1, Bi_FPN, []] # 18
  - [-1, 1, CBAM, []] # 19-P3/8

  - [1, 1, ODConv2d, [256, 3, 2]] # 20 P2->P3
  - [[-1, 11, 19], 1, Bi_FPN, []] # 21
  - [-1, 3, TACS, [256]] # 22-P3/8

  - [-1, 1, LAE, []]  # 23 P3->P4
  - [[-1, 12, 16], 1, Bi_FPN, []] # 24
  - [-1, 1, GAM, []] # 25-P4/16

  - [-1, 1, SCDown, [256, 3, 2]] # 26 P4->P5
  - [[-1, 13], 1, Bi_FPN, []] # 27
  - [-1, 3, C2fCIB, [256, True, True]] # 28-P5/32

  - [[22, 25, 28], 1, Detect_dyhead, [nc]] # Detect(P3, P4, P5)
